build/post/installing-and-using-clojure-and-clojurescipt.org
#+TITLE: Installing and using Clojure and ClojureScript with Emacs
: comments: false
: published: false
: title: Installing and using Clojure and ClojureScript with Emacs
: tags: Emacs Clojure ClojureScript install

Clojure is wonderful, being able to use ClojureScript in the browser even more so, however setting up a development environment is a pain in the ass. On top of this what's considered best practice is still changing from almost month to month.

Because of this I intend to document here as accurately as I can the process for getting a working environment in Emacs for both Clojure and ClojureScript. This is going to be a working document where I will update the procedure I use myself on an ongoing basis. In general I will be noting instructions to install the most recent verions of software and scripts. Mostly this is a description of how, not so much of why, but I'll try to include links to more info where relevant.

Much of the following is freely copied and modified from other tutorials on the net. A list of resources is at the bottom of the page. 

: -------------
** Clojure
 Clojure needs Java installed. So =java -version= should return something like:
 
: java version "1.8.0_11"
: Java(TM) SE Runtime Environment (build 1.8.0_11-b12)
: Java HotSpot(TM) 64-Bit Server VM (build 25.11-b03, mixed mode)
 
Minimum required version is 1.6, see [[http://clojure.org/getting_started?responseToken%3Ddfb93f0a2a572fc0c51e2373226b731e][here]].

In a freshly installed ubuntu 14.4 :

: sudo apt-get update 
: # to make sure apt-add-repository is installed:
: sudo apt-get install software-properties-common 
: sudo add-apt-repository ppa:webupd8team/java
: sudo apt-get update
: sudo apt-get install oracle-java8-installer 

You do not need to install Clojure as such, it's just a [[http://central.maven.org/maven2/org/clojure/clojure/1.6.0/][jar]] file. To take care of compiling Clojure programs and general project management there is [[http://leiningen.org/][leiningen]].

