www/unpublished/installing-and-using-clojure-and-clojurescipt.html
<!doctype html>
<!--[if lt IE 7]>      <html class="no-js lt-ie9 lt-ie8 lt-ie7" xmlns:ng="http://angularjs.org" lang="en"> <![endif]-->
<!--[if IE 7]>         <html class="no-js lt-ie9 lt-ie8" xmlns:ng="http://angularjs.org" lang="en"> <![endif]-->
<!--[if IE 8]>         <html class="no-js lt-ie9" xmlns:ng="http://angularjs.org" lang="en"> <![endif]-->
<!--[if gt IE 8]><!--> 
<html class="no-js" xmlns:ng="http://angularjs.org" lang="en">
  <!--<![endif]-->
  <head id="head"><title>Axion5-installing-and-using-clojure-and-clojurescipt</title><meta charset='utf-8'/><meta content='IE=edge,chrome=1' http-equiv='X-UA-Compatible'/><meta content='' name='description'/><meta name='viewport' content='width=device-width, initial-scale=1, maximum-scale=1'/>
<!--partial:html/ieshim.html--><!--[if lte IE 8]>
    <![endif]-->						    


<link rel="stylesheet" type="text/css" href="/css/bower/normalize.css/normalize.css">
<link rel="stylesheet" type="text/css" href="/css/bower/bootstrap/dist/css/bootstrap.css">
<link rel="stylesheet" type="text/css" href="/css/tweak.css">
<link rel="stylesheet" type="text/css" href="/css/prettify.css">
<link rel="stylesheet" type="text/css" href="/css/blog.css">
<link rel="stylesheet" type="text/css" href="/css/main.css">

<!--partial:html/google_analytics.html--></head>
  <body id="body" ><!--partial:html/body-blog.html--><!--[if lt IE 7]>
    <p class="chromeframe">You are using an <strong>outdated</strong> browser. Please <a href="http://browsehappy.com/">upgrade your browser</a> or <a href="http://www.google.com/chromeframe/?redirect=true">activate Google Chrome Frame</a> to improve your experience.</p>
    <![endif]-->

<!-- <div class="row"> -->
<div id="editbar--" > </div>
<!-- </div> -->


<div class="blog-masthead">
  <div class="container">
    <nav class="blog-nav">
      <a id="menu-blog" class="blog-nav-item" href="/">Blog</a>
      <a id="menu-projects" class="blog-nav-item" href="/projects.html">Projects</a>
      <a id="menu-websites" class="blog-nav-item" href="/websites.html">Websites</a>
      <a id="menu-aboutme" class="blog-nav-item" href="/aboutme.html">About me</a>
      <a id="site-title" href="/">Axion5</a>
    </nav>
  </div>
</div>

<div id="main" class="container">

  <div class="blog-header">
    <h1 class="blog-title">Axion5</h1>
    <p class="lead blog-description">The official example template of creating a blog with Bootstrap.</p>
  </div>

  <div align="justify" id="blog-body" class="row">

    <div class="col-sm-9 blog-main">

      <div class="pageTitle" id="pageTitle--"><header >
  <div class="title blog-post-title">  installing-and-using-clojure-and-clojurescipt  </div>
  <time class="blog-post-meta" datetime="31st of October 2014">  31st of October 2014  </time>
</header></div>
      <div  id="main--" class="blog-post"><!--partial:post/installing-and-using-clojure-and-clojurescipt.html--><?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Installing and using Clojure and ClojureScript with Emacs</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Installing and using Clojure and ClojureScript with Emacs"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-10-31T14:47+0100"/>
<meta name="author" content="michieljoris"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<style type="text/css">
 <!--/*--><![CDATA[/*><!--*/
  html { font-family: Times, serif; font-size: 12pt; }
  .title  { text-align: center; }
  .todo   { color: red; }
  .done   { color: green; }
  .tag    { background-color: #add8e6; font-weight:normal }
  .target { }
  .timestamp { color: #bebebe; }
  .timestamp-kwd { color: #5f9ea0; }
  .right  {margin-left:auto; margin-right:0px;  text-align:right;}
  .left   {margin-left:0px;  margin-right:auto; text-align:left;}
  .center {margin-left:auto; margin-right:auto; text-align:center;}
  p.verse { margin-left: 3% }
  pre {
	border: 1pt solid #AEBDCC;
	background-color: #F3F5F7;
	padding: 5pt;
	font-family: courier, monospace;
        font-size: 90%;
        overflow:auto;
  }
  table { border-collapse: collapse; }
  td, th { vertical-align: top;  }
  th.right  { text-align:center;  }
  th.left   { text-align:center;   }
  th.center { text-align:center; }
  td.right  { text-align:right;  }
  td.left   { text-align:left;   }
  td.center { text-align:center; }
  dt { font-weight: bold; }
  div.figure { padding: 0.5em; }
  div.figure p { text-align: center; }
  div.inlinetask {
    padding:10px;
    border:2px solid gray;
    margin:10px;
    background: #ffffcc;
  }
  textarea { overflow-x: auto; }
  .linenr { font-size:smaller }
  .code-highlighted {background-color:#ffff00;}
  .org-info-js_info-navigation { border-style:none; }
  #org-info-js_console-label { font-size:10px; font-weight:bold;
                               white-space:nowrap; }
  .org-info-js_search-highlight {background-color:#ffff00; color:#000000;
                                 font-weight:bold; }
  /*]]>*/-->
</style>
<script type="text/javascript">
/*
@licstart  The following is the entire license notice for the
JavaScript code in this tag.

Copyright (C) 2012-2013 Free Software Foundation, Inc.

The JavaScript code in this tag is free software: you can
redistribute it and/or modify it under the terms of the GNU
General Public License (GNU GPL) as published by the Free Software
Foundation, either version 3 of the License, or (at your option)
any later version.  The code is distributed WITHOUT ANY WARRANTY;
without even the implied warranty of MERCHANTABILITY or FITNESS
FOR A PARTICULAR PURPOSE.  See the GNU GPL for more details.

As additional permission under GNU GPL version 3 section 7, you
may distribute non-source (e.g., minimized or compacted) forms of
that code without the copy of the GNU GPL normally required by
section 4, provided you include this license notice and a URL
through which recipients can access the Corresponding Source.


@licend  The above is the entire license notice
for the JavaScript code in this tag.
*/
<!--/*--><![CDATA[/*><!--*/
 function CodeHighlightOn(elem, id)
 {
   var target = document.getElementById(id);
   if(null != target) {
     elem.cacheClassElem = elem.className;
     elem.cacheClassTarget = target.className;
     target.className = "code-highlighted";
     elem.className   = "code-highlighted";
   }
 }
 function CodeHighlightOff(elem, id)
 {
   var target = document.getElementById(id);
   if(elem.cacheClassElem)
     elem.className = elem.cacheClassElem;
   if(elem.cacheClassTarget)
     target.className = elem.cacheClassTarget;
 }
/*]]>*///-->
</script>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Installing and using Clojure and ClojureScript with Emacs</h1>

<pre class="example">
comments: false
published: false
title: Installing and using Clojure and ClojureScript with Emacs
tags: Emacs Clojure ClojureScript install
</pre>


<p>
Clojure is wonderful, being able to use ClojureScript in the browser even more so, however setting up a development environment is a pain in the ass. On top of this what's considered best practice is still changing from almost month to month.
</p>
<p>
Because of this I intend to document here as accurately as I can the process for getting a working environment in Emacs for both Clojure and ClojureScript. This is going to be a working document where I will update the procedure I use myself on an ongoing basis. In general I will be noting instructions to install the most recent verions of software and scripts. Mostly this is a description of how, not so much of why, but I'll try to include links to more info where relevant.
</p>
<p>
Much of the following is freely copied and modified from other tutorials on the net. A list of resources is at the bottom of the page. 
</p>
<pre class="example">
-------------
</pre>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Clojure</a></li>
<li><a href="#sec-2">Leiningen</a></li>
<li><a href="#sec-3">Emacs</a></li>
<li><a href="#sec-4">Clojure repl in Emacs</a></li>
<li><a href="#sec-5">ClojureScript repl in Emacs</a></li>
<li><a href="#sec-6">Project setup</a></li>
<li><a href="#sec-7">Fig-wheel</a></li>
<li><a href="#sec-8">Paredit</a></li>
<li><a href="#sec-9">Links</a>
<ul>
<li><a href="#sec-9-1">Books</a></li>
<li><a href="#sec-9-2">General web tutorials and docs on Clojure:</a></li>
<li><a href="#sec-9-3">Leiningen</a></li>
<li><a href="#sec-9-4">Emacs</a></li>
<li><a href="#sec-9-5">Repl</a></li>
<li><a href="#sec-9-6">Other</a></li>
<li><a href="#sec-9-7">React</a></li>
<li><a href="#sec-9-8">Starter projects:</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1">Scratch</a></div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">Clojure</h3>
<div class="outline-text-3" id="text-1">

<p> Clojure needs Java installed. So <code>java -version</code> should return something like:
</p>
<pre class="example">
java version "1.8.0_11"
Java(TM) SE Runtime Environment (build 1.8.0_11-b12)
Java HotSpot(TM) 64-Bit Server VM (build 25.11-b03, mixed mode)
</pre>


<p> 
Minimum required version is 1.6, see <a href="http://clojure.org/getting_started?responseToken=dfb93f0a2a572fc0c51e2373226b731e">here</a>.
</p>
<p>
In a freshly installed ubuntu 14.4 :
</p>
<pre class="example">
sudo apt-get update 
# to make sure apt-add-repository is installed:
sudo apt-get install software-properties-common 
sudo add-apt-repository ppa:webupd8team/java
sudo apt-get update
sudo apt-get install oracle-java8-installer 
</pre>


<p>
You do not need to install Clojure as such, it's just a <a href="http://central.maven.org/maven2/org/clojure/clojure/1.6.0/">jar</a> file. To take care of compiling Clojure programs and general project management there is <a href="http://leiningen.org/">leiningen</a>.
</p>
</div>

</div>
