www/unpublished/installing-and-using-clojure-and-clojurescipt.html

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">Leiningen</h3>
<div class="outline-text-3" id="text-2">


<p>
Download the <a href="https://raw.githubusercontent.com/technomancy/leiningen/stable/bin/lein">lein</a> script 
</p><pre class="example">
wget https://raw.githubusercontent.com/technomancy/leiningen/stable/bin/lein 
</pre>


<p>
Place it on your $PATH where your shell can find it (eg. ~/bin)
</p><pre class="example">
sudo cp lein ~/bin
</pre>


<p>
Set it to be executable 
</p><pre class="example">
chmod a+x ~/bin/lein 
</pre>


<p>
Run it and it will download the self-install package
</p><pre class="example">
lein 
&gt; ....
&gt; Downloading Leiningen to /home/michieljoris/.lein/self-installs/leiningen-2.5.0-standalone.jar now...
&gt; ....
</pre>


<p>
Following is a list of most used options:
</p>



<pre class="example">Leiningen is a tool for working with Clojure projects.
Several tasks are available:
version             Print version for Leiningen and the current JVM.
upgrade             Upgrade Leiningen to specified version or latest stable.
new                 Generate project scaffolding based on a template.
run                 Run a -main function with optional command-line arguments.
uberjar             Package up the project files and dependencies into a jar file.
repl                Start a repl session either with the current project or standalone.
search              Search remote maven repositories for matching jars.

clean               Remove all files from project's target-path.
deps                Download all dependencies.

Run `lein help $TASK` for details.

</pre>








<p>
From <a href="http://en.wikipedia.org/wiki/Leiningen_(software)">wikipedia</a> :
</p>
<blockquote>


<p>
Leiningen is a build automation and dependency management tool for the simple
configuration of software projects written in the Clojure programming language.
</p>
<p>
Leiningen's features can be extended via a plugin system, and it is supplied
with a command line interface that can initiate a number of actions, which
include:
</p>
<ul>
<li>The generation of a simple Clojure project skeleton
</li>
<li>Packaging of project code and dependencies into an 'Uberjar' .jar file
</li>
<li>Start an interactive REPL that has the classpath correctly set to load project
  dependencies
</li>
<li>Ahead-of-time (AOT) compilation,
</li>
<li>Dependency resolution (with automatic library downloading)
</li>
</ul>



</blockquote>


<p>
Generate a simple Clojure project skeleton:
</p>
<pre class="example">
lein new app some-app-name
</pre>





<pre class="example">| .gitignore
| doc
| | intro.md
| LICENSE
| project.clj
| resources
| README.md
| src
| | some_app_name
| | | core.clj
| test
| | some_app_name
| | | core_test.clj
</pre>


<pre class="example">
cd some-app-name
lein run
</pre>


<p>
Lein will retrieve some dependencies as specified in project.clj, compile the project and then print:
</p>
<pre class="example">
Hello, World!
</pre>


<p>
Run it again:
</p>
<pre class="example">
lein run
</pre>


<p>
and it'll only have to start the jvm and compile and then prints the same.
</p>
<p>
Build a standalone jar:
</p><pre class="example">
lein uberjar
</pre>


<p>
And then run it with:
</p><pre class="example">
java -jar target/uberjar/some-app-name-0.1.0-SNAPSHOT-standalone.jar 
</pre>


<p>
Run a repl in the project:
</p><pre class="example">
lein repl
</pre>


<p>
And then at the prompt:
</p><pre class="example">
some-app-name.core=&gt; (-main)
Hello, World!
nil
some-app-name.core=&gt; (exit)
Bye for now!
</pre>


<p>
Search for a clojar with:
</p><pre class="example">
lein search clojar-name
</pre>


<p>
This will take some time the first time. 
</p>
<p>
A very useful tutorial on leiningen is <a href="https://github.com/technomancy/leiningen/blob/stable/doc/TUTORIAL.md">here</a>. Some interesting sections are <a href="https://github.com/technomancy/leiningen/blob/stable/doc/TUTORIAL.md#checkout-dependencies">checkouts</a> (similar to npm link) and <a href="https://github.com/technomancy/leiningen/blob/stable/doc/TUTORIAL.md#profiles">profiles</a>.
</p>
<p>
Leiningen is configured by the project.clj file in your project directory. For an annotated reference of all of the options that may be set in a project.clj file see <a href="https://github.com/technomancy/leiningen/blob/stable/sample.project.clj">here.</a> A sample project.clj follows as used in the rest of this post, uncomment the relevant sections as needed.
</p>



<pre class="src src-clojure">(<span style="color: #00ffff;">defproject</span> <span style="color: #87cefa;">sample-app</span> <span style="color: #ffa07a;">"0.1.0-SNAPSHOT"</span>
  <span style="color: #7fffd4;">:description</span> <span style="color: #ffa07a;">"FIXME: write description"</span>
  <span style="color: #7fffd4;">:url</span> <span style="color: #ffa07a;">"http://example.com/FIXME"</span>
  <span style="color: #7fffd4;">:license</span> {<span style="color: #7fffd4;">:name</span> <span style="color: #ffa07a;">"Eclipse Public License"</span>
            <span style="color: #7fffd4;">:url</span> <span style="color: #ffa07a;">"http://www.eclipse.org/legal/epl-v10.html"</span>}
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Warns users of earlier versions of Leiningen. Set this if your project</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">relies on features only found in newer Leiningen versions.</span>
  <span style="color: #7fffd4;">:min-lein-version</span> <span style="color: #ffa07a;">"2.0.0"</span>
  <span style="color: #7fffd4;">:dependencies</span> [[org.clojure/clojure <span style="color: #ffa07a;">"1.6.0"</span>]
                 [org.clojure/clojurescript <span style="color: #ffa07a;">"0.0-2371"</span>]
                 [com.cemerick/piggieback <span style="color: #ffa07a;">"0.1.3"</span>]
                 [weasel <span style="color: #ffa07a;">"0.4.2"</span>]
                 [figwheel <span style="color: #ffa07a;">"0.1.5-SNAPSHOT"</span>] 
                 ]
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Plugins are code that runs in Leiningen itself and usually</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">provide new tasks or hooks.</span>
  <span style="color: #7fffd4;">:plugins</span> [
            [lein-cljsbuild <span style="color: #ffa07a;">"1.0.3"</span>]
            [lein-figwheel <span style="color: #ffa07a;">"0.1.5-SNAPSHOT"</span>]
            <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">[cider/cider-nrepl "0.8.0-SNAPSHOT"]</span>
            ]

  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Profiles</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Each active profile gets merged into the project map. The :dev</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">and :user profiles are active by default, but the latter should be</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">looked up in ~/.lein/profiles.clj rather than set in project.clj.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Use the with-profiles higher-order task to run a task with a</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">different set of active profiles.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">See `lein help profiles` for a detailed explanation.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:profiles {:uberjar {:aot :all}}</span>

  <span style="color: #ff7f24;">;;; </span><span style="color: #ff7f24;">Entry Point</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">The -main function in this namespace will be run at launch</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(either via `lein run` or from an uberjar). It should be variadic:</span>
  <span style="color: #ff7f24;">;;</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(ns my.service.runner</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(:gen-class))</span>
  <span style="color: #ff7f24;">;;</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(defn -main</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">"Application entry point"</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">[&amp; args]</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(comment Do app initialization here))</span>
  <span style="color: #ff7f24;">;;</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:main my.service.runner</span>

  <span style="color: #ff7f24;">;;; </span><span style="color: #ff7f24;">Filesystem Paths</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">If you'd rather use a different directory structure, you can set these.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Paths that contain "inputs" are string vectors, "outputs" are strings.</span>
  <span style="color: #7fffd4;">:source-paths</span> [<span style="color: #ffa07a;">"src"</span>]
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:java-source-paths ["src/main/java"] ; Java source is stored separately.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:test-paths ["test" "src/test/clojure"]</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:resource-paths ["src/main/resource"] ; Non-code files included in classpath/jar.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">All generated files will be placed in :target-path. In order to avoid</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">cross-profile contamination (for instance, uberjar classes interfering</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">with development), it's recommended to include %s in in your custom</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:target-path, which will splice in names of the currently active profiles.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:target-path "target/%s/"</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Directory in which to place AOT-compiled files. Including %s will</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">splice the :target-path into this value.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:compile-path "%s/classy-files"</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Directory in which to extract native components from inside dependencies.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Including %s will splice the :target-path into this value. Note that this</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">is not where to *look* for existing native libraries; use :jvm-opts with</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">-Djava.library.path=... instead for that.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:native-path "%s/bits-n-stuff"</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Directories under which `lein clean` removes files.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Specified by keyword or keyword-chain to get-in path in this defproject.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Both a single path and a collection of paths are accepted as each.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">For example, if the other parts of project are like:</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:target-path "target"</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:compile-path "classes"</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:foobar-paths ["foo" "bar"]</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:baz-config {:qux-path "qux"}</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:clean-targets below lets `lein clean` remove files under "target",</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">"classes", "foo", "bar", "qux", and "out".</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">By default, will protect paths outside the project root and within standard</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">lein source directories ("src", "test", "resources", "doc", "project.clj").</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">However, this protection can be overridden with metadata on the :clean-targets</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">vector - ^{:protect false}</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:clean-targets [:target-path :compile-path :foobar-paths</span>
  <span style="color: #ff7f24;">;;                 </span><span style="color: #ff7f24;">[:baz-config :qux-path] "out"]</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Workaround for http://dev.clojure.org/jira/browse/CLJ-322 by deleting</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">compilation artifacts for namespaces that come from dependencies.</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:clean-non-project-classes true</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Paths to include on the classpath from each project in the</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">checkouts/ directory. (See the FAQ in the Readme for more details</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">about checkout dependencies.) Set this to be a vector of</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">functions that take the target project as argument. Defaults to</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">[:source-paths :compile-path :resource-paths], but you could use</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">the following to share code from the test suite:</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:checkout-deps-shares [:source-paths :test-paths</span>
  <span style="color: #ff7f24;">;;                        </span><span style="color: #ff7f24;">~(fn [p] (str (:root p) "/lib/dev/*"))]</span>


  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">All generated files will be placed in :target-path. In order to avoid</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">cross-profile contamination (for instance, uberjar classes interfering</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">with development), it's recommended to include %s in in your custom</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:target-path, which will splice in names of the currently active profiles.</span>

  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Options to change the way the REPL behaves.</span>
  <span style="color: #7fffd4;">:repl-options</span> { <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Specify the string to print when prompting for input.</span>
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">defaults to something like (fn [ns] (str *ns* "=&gt; "))</span>
                 <span style="color: #7fffd4;">:prompt</span> (<span style="color: #00ffff;">fn</span> [ns] (<span style="color: #b0c4de;">str</span> <span style="color: #ffa07a;">"your command for &lt;"</span> ns <span style="color: #ffa07a;">"&gt;, master? "</span> ))
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">What to print when the repl session starts.</span>
                 <span style="color: #7fffd4;">:welcome</span> (<span style="color: #b0c4de;">println</span> <span style="color: #ffa07a;">"Welcome to the magical world of the repl!"</span>)
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Specify the ns to start the REPL in (overrides :main in</span>
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">this case only)</span>
                 <span style="color: #7fffd4;">:init-ns</span> foo.bar
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">This expression will run when first opening a REPL, in the</span>
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">namespace from :init-ns or :main if specified.</span>
                 <span style="color: #7fffd4;">:init</span> (<span style="color: #b0c4de;">println</span> <span style="color: #ffa07a;">"here we are in"</span> *ns*)
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Print stack traces on exceptions (highly recommended, but</span>
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">currently overwrites *1, *2, etc).</span>
                 <span style="color: #7fffd4;">:caught</span> clj-stacktrace.repl/pst+
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Skip's the default requires and printed help message.</span>
                 <span style="color: #7fffd4;">:skip-default-init</span> false
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Customize the socket the repl task listens on and</span>
                 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">attaches to.</span>
                 <span style="color: #7fffd4;">:host</span> <span style="color: #ffa07a;">"0.0.0.0"</span>
                 <span style="color: #7fffd4;">:port</span> 4001
                 <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">for more options see the sample project.clj</span>
                 <span style="color: #7fffd4;">:nrepl-middleware</span> [cemerick.piggieback/wrap-cljs-repl]}


  <span style="color: #7fffd4;">:figwheel</span> {
             <span style="color: #7fffd4;">:http-server-root</span> <span style="color: #ffa07a;">"public"</span> <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">this will be in resources/</span>
             <span style="color: #7fffd4;">:server-port</span> 3449          <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">default</span>

             <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">CSS reloading (optional)</span>
             <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:css-dirs has no default value </span>
             <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">if :css-dirs is set figwheel will detect css file changes and</span>
             <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">send them to the browser</span>
             <span style="color: #7fffd4;">:css-dirs</span> [<span style="color: #ffa07a;">"resources/public/css"</span>]

             <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Server Ring Handler (optional)</span>
             <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">if you want to embed a ring handler into the figwheel http-kit</span>
             <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">server</span>
             <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:ring-handler example.server/handler </span>
             } 


  <span style="color: #7fffd4;">:cljsbuild</span> {
              <span style="color: #7fffd4;">:builds</span> [{
                        <span style="color: #7fffd4;">:id</span> <span style="color: #ffa07a;">"dev"</span>
                        <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">The path to the top-level ClojureScript source directory:</span>
                        <span style="color: #7fffd4;">:source-paths</span> [<span style="color: #ffa07a;">"src-cljs"</span>]
                        <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">The standard ClojureScript compiler options:</span>
                        <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(See the ClojureScript compiler documentation for details.)</span>
                        <span style="color: #7fffd4;">:compiler</span> {
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">The path to the JavaScript file that will be output.</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Defaults to "target/cljsbuild-main.js".</span>
                                   <span style="color: #7fffd4;">:output-to</span> <span style="color: #ffa07a;">"resources/public/js/main.js"</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">See</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">https://github.com/clojure/clojurescript/wiki/Source-maps</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Sets the output directory for temporary</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">files used during compilation. Must be</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">unique among all :builds. Defaults to</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">"target/cljsbuild-compiler-X" (where X is</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">a unique integer).</span>
                                   <span style="color: #7fffd4;">:output-dir</span> <span style="color: #ffa07a;">"resources/public/js"</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Defaults to :whitespace.</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:source-map "resources/public/js/main.js.map"</span>
                                   <span style="color: #7fffd4;">:source-map</span> true
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">The optimization level. May be :whitespace, :simple, or :advanced.</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:optimizations :whitespace</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:optimizations :simple</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:optimizations :advanced</span>
                                   <span style="color: #7fffd4;">:optimizations</span> <span style="color: #7fffd4;">:none</span>

                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Configure externs files for external libraries.</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Defaults to the empty vector [].</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">For this entry, and those below, you can find a very good explanation at:</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">http://lukevanderhart.com/2011/09/30/using-javascript-and-clojurescript.html</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:externs ["jquery-externs.js"]</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Adds dependencies on external libraries. Note that files in these directories will be</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">watched and a rebuild will occur if they are modified.</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Defaults to the empty vector [].</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:libs ["closure/library/third_party/closure"]</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Adds dependencies on foreign libraries. Be sure that the url returns a HTTP Code 200</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Defaults to the empty vector [].</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:foreign-libs [{:file "http://example.com/remote.js"</span>
                                   <span style="color: #ff7f24;">;;                 </span><span style="color: #ff7f24;">:provides ["my.example"]}]</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Prepends the contents of the given files to each output file.</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Defaults to the empty vector [].</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:preamble ["license.js"]</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Configure the input and output languages for the closure library.</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">May be :ecmascript3, ecmascript5, or ecmascript5-strict.</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Defaults to ecmascript3.</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:language-in :ecmascript5</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:language-out :ecmascript5</span>
                                   <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">:pretty-print true</span>
                                   }
                        }]
              }

  )

</pre>


</div>

</div>
