build/post/installing-and-using-clojure-and-clojurescipt.org
** ClojureScript
   ClojureScript is compiled by Clojure code.  
** Emacs
Use [[https://github.com/clojure-emacs/cider][cider]] for Clojure programming, install using package manager.

To load the necessary info, otherwise package-install doesn't work: 
: M-x list-packages
or:
: M-x package-refresh-contents
  
Then:
: M-x package-install [RET] cider [RET]

Also make sure clojure-mode is installed:
: M-x package-install [RET] clojure-mode [RET]

** Clojure repl in Emacs
Cider needs nrepl installed for your project, so first, check version of cider:
: M-x cider-version
> CIDER 0.8.0-snapshot

Make sure that in ~/.lein/profiles.clj is the following:
: {:user {:plugins [[cider/cider-nrepl "0.8.0-SNAPSHOT"]]}}

or per project add to =project.clj=
: :plugins [[cider/cider-nrepl "0.8.0-SNAPSHOT"]]

and that the versions match. Snapshot should be in capitals here.

Open a file from your Clojure or ClojureScript project and start a repl with:
: M-x cider-jack-in

If you get the following error when starting the cider-jack-in repl:
: error in process filter: let: Symbol's value as variable is void: clojure--prettify-symbols-alist
: error in process filter: Symbol's value as variable is void: clojure--prettify-symbols-alist

add this to the Emacs init files;
: (defconst clojure--prettify-symbols-alist
:   '(("fn"  . ?λ)))

This shouldn't be because this is defined in clojure-mode.el however somehow it
isn't evaluated for me.

You can also start a repl in the project's directory (using bash) with:
: lein run
: nREPL server started on port 56155 on host 127.0.0.1 - nrepl://127.0.0.1:56155
: ....

, take note of host and port and then to connect to it in Emacs: 
: M-x cider-connect [RET] localhost [RET] 56155

Some cider keyboard shortcuts:
: C-c C-z to switch to the repl from a clj buffer:
: C-M-x to evaluate top form. Output goes to repl
: C-c M-n	Switch to namespace of the current buffer
: C-x C-e	Evaluate the expression immediately preceding point
: C-c C-k	Compile current buffer
: C-, to save and load buffer into repl (custom shortcut)
: C-c C-f	Evaluate the top level form under point and pretty-print the result in a popup buffer.
: C-c C-b	Interrupt any pending evaluations.
: C-c C-d d Display doc string for the symbol at point. If invoked with a prefix argument, or no symbol is found at point, prompt for a symbol.

In the repl:
: C-j	Open a new line and indent.
: C-c M-o	Clear the entire REPL buffer, leaving only a prompt.
: C-c C-o	Remove the output of the previous evaluation from the REPL buffer.
: C-c C-u	Kill all text from the prompt to the current point.
: C-c C-b C-c C-c	Interrupt any pending evaluations.
: C-up C-down	Goto to previous/next input in history.
: M-p M-n	Search the previous/next item in history using the current input as search pattern. If M-p/M-n is typed two times in a row, the second invocation uses the same search pattern (even if the current input has changed).
: M-s M-r	Search forward/reverse through command history with regex.
: C-c C-n C-c C-p	Move between the current and previous prompts in the REPL buffer. Pressing RET on a line with old input copies that line to the newest prompt.
: TAB	Complete symbol at point.
: C-c C-d d	Display doc string for the symbol at point. If invoked with a prefix argument, or no symbol is found at point, prompt for a symbol
: C-c M-n	Select a namespace and switch to it.

You can connect to multiple nREPL servers using M-x cider-jack-in multiple times. To close the current nREPL connection, use M-x nrepl-close. M-x cider-quit closes all connections. 

Many more shortcuts at the [[https://github.com/clojure-emacs/cider][cider]] site, as well as info on configuring cider.

** ClojureScript repl in Emacs

   
   
   
Before explaining how to start a ClojureScript repl in Emacs it is instructional to see how it's done from the shell command line.

First off, a ClojureScript repl always builds on and is started in a Clojure repl. So first thing to do is to start a Clojure repl:
: lein repl

From here we can connect to a JavaScript execution environment.  Clojure and ClojureScript 
Then, from the ClojureScript [[https://github.com/clojure/clojurescript/wiki/The-REPL-and-Evaluation-Environments][wiki]]:
  
#+BEGIN_QUOTE
The basic usage of the REPL is always the same:

    require cljs.repl
    require the namespace which implements the desired evaluation environment
    create a new evaluation environment
    start the REPL with the created environment

Using the REPL will also feel the same in each environment; forms are entered, results are printed and side-effects happen where they make the most sense.
#+END_QUOTE  
  
   https://github.com/emezeske/lein-cljsbuild 
 
** Project setup
** Fig-wheel
** Paredit
When editing Clojure in Emacs use paredit. Some shortcuts:
: M-(	paredit-wrap-round, surround expression after point in parentheses
: C-→	Slurp; move closing parenthesis to the right to include next expression
: C-←	Barf; move closing parenthesis to the left to exclude last expression
: C-M-f, C-M-b	Move to the opening/closing parenthesis

** Links
*** Books
Two books I've found useful:    
+ [[http://www.amazon.com/Clojure-Programming-Chas-Emerick/dp/1449394701/ref%3Dsr_1_1/186-5337347-5323310?ie%3DUTF8&qid%3D1414693506&sr%3D8-1&keywords%3Dclojure][Clojure Programming]]
+ [[http://www.amazon.com/Programming-Clojure-Stuart-Halloway/dp/1934356867/ref%3Dsr_1_4/186-5337347-5323310?ie%3DUTF8&qid%3D1414693506&sr%3D8-4&keywords%3Dclojure][Programming Clojure]]
There's also a book on ClojureScript:
+ [[http://www.amazon.com/ClojureScript-Up-Running-Stuart-Sierra/dp/1449327435/ref%3Dsr_1_1/186-5337347-5323310?ie%3DUTF8&qid%3D1414693967&sr%3D8-1&keywords%3Dclojurescript][ClojureScript Up and Running]]
  
*** General web tutorials and docs on Clojure:
+ http://learnxinyminutes.com/docs/clojure/ | Learn clojure in Y Minutes
+ http://www.braveclojure.com/ | Learn to Program the World's Most Bodacious Language with Clojure for the Brave and True
+ http://java.ociweb.com/mark/clojure/article.html | Clojure - Functional Programming for the JVM
+ http://clojuredocs.org/quickref | Clojure Quick Reference | ClojureDocs - Community-Powered Clojure Documentation and Examples
+ https://github.com/clojure/clojurescript | clojure/clojurescript · GitHub
  
*** Leiningen  
+ http://leiningen.org/ | Leiningen
+ https://github.com/technomancy/leiningen/blob/stable/doc/TUTORIAL.md | leiningen/TUTORIAL.md at stable · technomancy/leiningen · GitHub
+ https://github.com/emezeske/lein-cljsbuild | emezeske/lein-cljsbuild · GitHub
+ https://github.com/technomancy/leiningen/wiki/Faster | Faster startup time
*** Emacs
+ http://clojure-doc.org/articles/tutorials/emacs.html 
