www/unpublished/installing-and-using-clojure-and-clojurescipt.html

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">Emacs</h3>
<div class="outline-text-3" id="text-3">

<p>Use <a href="https://github.com/clojure-emacs/cider">cider</a> for Clojure programming, install using package manager.
</p>
<p>
To load the necessary info, otherwise package-install doesn't work: 
</p><pre class="example">
M-x list-packages
</pre>

<p>or:
</p><pre class="example">
M-x package-refresh-contents
</pre>


<p>  
Then:
</p><pre class="example">
M-x package-install [RET] cider [RET]
</pre>


<p>
Also make sure clojure-mode is installed:
</p><pre class="example">
M-x package-install [RET] clojure-mode [RET]
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4">Clojure repl in Emacs</h3>
<div class="outline-text-3" id="text-4">

<p>Cider needs nrepl installed for your project, so first, check version of cider:
</p><pre class="example">
M-x cider-version
</pre>

<p>&gt; CIDER 0.8.0-snapshot
</p>
<p>
Make sure that in ~/.lein/profiles.clj is the following:
</p><pre class="example">
{:user {:plugins [[cider/cider-nrepl "0.8.0-SNAPSHOT"]]}}
</pre>


<p>
or per project add to <code>project.clj</code>
</p><pre class="example">
:plugins [[cider/cider-nrepl "0.8.0-SNAPSHOT"]]
</pre>


<p>
and that the versions match. Snapshot should be in capitals here.
</p>
<p>
Open a file from your Clojure or ClojureScript project and start a repl with:
</p><pre class="example">
M-x cider-jack-in
</pre>


<p>
If you get the following error when starting the cider-jack-in repl:
</p><pre class="example">
error in process filter: let: Symbol's value as variable is void: clojure--prettify-symbols-alist
error in process filter: Symbol's value as variable is void: clojure--prettify-symbols-alist
</pre>


<p>
add this to the Emacs init files;
</p><pre class="example">
(defconst clojure--prettify-symbols-alist
  '(("fn"  . ?λ)))
</pre>


<p>
This shouldn't be because this is defined in clojure-mode.el however somehow it
isn't evaluated for me.
</p>
<p>
You can also start a repl in the project's directory (using bash) with:
</p><pre class="example">
lein run
nREPL server started on port 56155 on host 127.0.0.1 - nrepl://127.0.0.1:56155
....
</pre>


<p>
, take note of host and port and then to connect to it in Emacs: 
</p><pre class="example">
M-x cider-connect [RET] localhost [RET] 56155
</pre>


<p>
Some cider keyboard shortcuts:
</p><pre class="example">
C-c C-z to switch to the repl from a clj buffer:
C-M-x to evaluate top form. Output goes to repl
C-c M-n       Switch to namespace of the current buffer
C-x C-e       Evaluate the expression immediately preceding point
C-c C-k       Compile current buffer
C-, to save and load buffer into repl (custom shortcut)
C-c C-f       Evaluate the top level form under point and pretty-print the result in a popup buffer.
C-c C-b       Interrupt any pending evaluations.
C-c C-d d Display doc string for the symbol at point. If invoked with a prefix argument, or no symbol is found at point, prompt for a symbol.
</pre>


<p>
In the repl:
</p><pre class="example">
C-j   Open a new line and indent.
C-c M-o       Clear the entire REPL buffer, leaving only a prompt.
C-c C-o       Remove the output of the previous evaluation from the REPL buffer.
C-c C-u       Kill all text from the prompt to the current point.
C-c C-b C-c C-c       Interrupt any pending evaluations.
C-up C-down   Goto to previous/next input in history.
M-p M-n       Search the previous/next item in history using the current input as search pattern. If M-p/M-n is typed two times in a row, the second invocation uses the same search pattern (even if the current input has changed).
M-s M-r       Search forward/reverse through command history with regex.
C-c C-n C-c C-p       Move between the current and previous prompts in the REPL buffer. Pressing RET on a line with old input copies that line to the newest prompt.
TAB   Complete symbol at point.
C-c C-d d     Display doc string for the symbol at point. If invoked with a prefix argument, or no symbol is found at point, prompt for a symbol
C-c M-n       Select a namespace and switch to it.
</pre>


<p>
You can connect to multiple nREPL servers using M-x cider-jack-in multiple times. To close the current nREPL connection, use M-x nrepl-close. M-x cider-quit closes all connections. 
</p>
<p>
Many more shortcuts at the <a href="https://github.com/clojure-emacs/cider">cider</a> site, as well as info on configuring cider.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5">ClojureScript repl in Emacs</h3>
<div class="outline-text-3" id="text-5">


<p>   
A ClojureScript repl builds on and is started in a Clojure repl. The <code>clojure</code> and <code>cljs</code> namespaces come with some standard libraries to make this possible, namely <code>cljs.repl</code>, <code>cljs.repl.rhino</code> and <code>clojure.browser.repl</code>.
</p>
<p>
From the ClojureScript <a href="https://github.com/clojure/clojurescript/wiki/The-REPL-and-Evaluation-Environments">wiki</a>:
</p>
<blockquote>

<p>The basic usage of the REPL is always the same:
</p>
<p>
    require cljs.repl
    require the namespace which implements the desired evaluation environment
    create a new evaluation environment
    start the REPL with the created environment
</p>
<p>
Using the REPL will also feel the same in each environment; forms are entered, results are printed and side-effects happen where they make the most sense.
</p>
</blockquote>



<p>  
   <a href="https://github.com/emezeske/lein-cljsbuild">https://github.com/emezeske/lein-cljsbuild</a> 
</p>
</div>

</div>

<div id="outline-container-6" class="outline-3">
<h3 id="sec-6">Project setup</h3>
<div class="outline-text-3" id="text-6">

</div>

</div>

<div id="outline-container-7" class="outline-3">
<h3 id="sec-7">Fig-wheel</h3>
<div class="outline-text-3" id="text-7">

</div>

</div>

<div id="outline-container-8" class="outline-3">
<h3 id="sec-8">Paredit</h3>
<div class="outline-text-3" id="text-8">

<p>When editing Clojure in Emacs use paredit. Some shortcuts:
</p><pre class="example">
M-(   paredit-wrap-round, surround expression after point in parentheses
C-→   Slurp; move closing parenthesis to the right to include next expression
C-←   Barf; move closing parenthesis to the left to exclude last expression
C-M-f, C-M-b  Move to the opening/closing parenthesis
</pre>


</div>

</div>

<div id="outline-container-9" class="outline-3">
<h3 id="sec-9">Links</h3>
<div class="outline-text-3" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-4">
<h4 id="sec-9-1">Books</h4>
<div class="outline-text-4" id="text-9-1">

<p>Two books I've found useful:    
</p><ul>
<li><a href="http://www.amazon.com/Clojure-Programming-Chas-Emerick/dp/1449394701/ref=sr_1_1/186-5337347-5323310?ie=UTF8&amp;qid=1414693506&amp;sr=8-1&amp;keywords=clojure">Clojure Programming</a>
</li>
<li><a href="http://www.amazon.com/Programming-Clojure-Stuart-Halloway/dp/1934356867/ref=sr_1_4/186-5337347-5323310?ie=UTF8&amp;qid=1414693506&amp;sr=8-4&amp;keywords=clojure">Programming Clojure</a>
</li>
</ul>

<p>There's also a book on ClojureScript:
</p><ul>
<li><a href="http://www.amazon.com/ClojureScript-Up-Running-Stuart-Sierra/dp/1449327435/ref=sr_1_1/186-5337347-5323310?ie=UTF8&amp;qid=1414693967&amp;sr=8-1&amp;keywords=clojurescript">ClojureScript Up and Running</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-9-2" class="outline-4">
<h4 id="sec-9-2">General web tutorials and docs on Clojure:</h4>
<div class="outline-text-4" id="text-9-2">

<ul>
<li><a href="http://learnxinyminutes.com/docs/clojure/">http://learnxinyminutes.com/docs/clojure/</a> | Learn clojure in Y Minutes
</li>
<li><a href="http://www.braveclojure.com/">http://www.braveclojure.com/</a> | Learn to Program the World's Most Bodacious Language with Clojure for the Brave and True
</li>
<li><a href="http://java.ociweb.com/mark/clojure/article.html">http://java.ociweb.com/mark/clojure/article.html</a> | Clojure - Functional Programming for the JVM
</li>
<li><a href="http://clojuredocs.org/quickref">http://clojuredocs.org/quickref</a> | Clojure Quick Reference | ClojureDocs - Community-Powered Clojure Documentation and Examples
</li>
<li><a href="https://github.com/clojure/clojurescript">https://github.com/clojure/clojurescript</a> | clojure/clojurescript · GitHub
</li>
</ul>


</div>

</div>

<div id="outline-container-9-3" class="outline-4">
<h4 id="sec-9-3">Leiningen</h4>
<div class="outline-text-4" id="text-9-3">

<ul>
<li><a href="http://leiningen.org/">http://leiningen.org/</a> | Leiningen
</li>
<li><a href="https://github.com/technomancy/leiningen/blob/stable/doc/TUTORIAL.md">https://github.com/technomancy/leiningen/blob/stable/doc/TUTORIAL.md</a> | leiningen/TUTORIAL.md at stable · technomancy/leiningen · GitHub
</li>
<li><a href="https://github.com/emezeske/lein-cljsbuild">https://github.com/emezeske/lein-cljsbuild</a> | emezeske/lein-cljsbuild · GitHub
</li>
<li><a href="https://github.com/technomancy/leiningen/wiki/Faster">https://github.com/technomancy/leiningen/wiki/Faster</a> | Faster startup time
</li>
</ul>

</div>

</div>
