build/post/installing-and-using-clojure-and-clojurescipt.org
*** Repl 
+ https://github.com/clojure-emacs/cider  | Clojure environment for Emacs
+ https://github.com/clojure/clojurescript/wiki/The-REPL-and-Evaluation-Environments | The REPL and Evaluation Environments · clojure/clojurescript Wiki · GitHub
+ https://github.com/cemerick/piggieback | cemerick/piggieback · GitHub
+ https://github.com/cemerick/austin#project-repls | cemerick/austin · GitHub
+ https://github.com/tomjakubowski/weasel | tomjakubowski/weasel · GitHub
*** Other  
+ https://github.com/bhauman/lein-figwheel | bhauman/lein-figwheel · GitHub
+ http://rigsomelight.com/2014/05/01/interactive-programming-flappy-bird-clojurescript.html | Interactive Programming in ClojureScript

*** React  
+ http://facebook.github.io/react/ | A JavaScript library for building user interfaces | React
+ https://github.com/swannodette/om | swannodette/om · GitHub
+ http://clojure-doc.org/articles/tutorials/emacs.html | Clojure with Emacs | Clojure Documentation | Clojure Docs
+ https://github.com/holmsand/reagent | holmsand/reagent · GitHub
+ https://github.com/levand/quiescent | levand/quiescent · GitHub
  
*** Starter projects:    
+ https://github.com/plexus/chestnut | plexus/chestnut · GitHub
+ http://blog.michielborkent.nl/blog/2014/09/25/figwheel-keep-Om-turning/ | Figwheel Keep Om Turning! - Through the cracks of immutability
  

    
    
