www/unpublished/installing-and-using-clojure-and-clojurescipt.html

<div id="outline-container-9-4" class="outline-4">
<h4 id="sec-9-4">Emacs</h4>
<div class="outline-text-4" id="text-9-4">

<ul>
<li><a href="http://clojure-doc.org/articles/tutorials/emacs.html">http://clojure-doc.org/articles/tutorials/emacs.html</a> 
</li>
</ul>

</div>

</div>

<div id="outline-container-9-5" class="outline-4">
<h4 id="sec-9-5">Repl</h4>
<div class="outline-text-4" id="text-9-5">

<ul>
<li><a href="https://github.com/clojure-emacs/cider">https://github.com/clojure-emacs/cider</a>  | Clojure environment for Emacs
</li>
<li><a href="https://github.com/clojure/clojurescript/wiki/The-REPL-and-Evaluation-Environments">https://github.com/clojure/clojurescript/wiki/The-REPL-and-Evaluation-Environments</a> | The REPL and Evaluation Environments · clojure/clojurescript Wiki · GitHub
</li>
<li><a href="https://github.com/cemerick/piggieback">https://github.com/cemerick/piggieback</a> | cemerick/piggieback · GitHub
</li>
<li><a href="https://github.com/cemerick/austin#project-repls">https://github.com/cemerick/austin#project-repls</a> | cemerick/austin · GitHub
</li>
<li><a href="https://github.com/tomjakubowski/weasel">https://github.com/tomjakubowski/weasel</a> | tomjakubowski/weasel · GitHub
</li>
</ul>

</div>

</div>

<div id="outline-container-9-6" class="outline-4">
<h4 id="sec-9-6">Other</h4>
<div class="outline-text-4" id="text-9-6">

<ul>
<li><a href="https://github.com/bhauman/lein-figwheel">https://github.com/bhauman/lein-figwheel</a> | bhauman/lein-figwheel · GitHub
</li>
<li><a href="http://rigsomelight.com/2014/05/01/interactive-programming-flappy-bird-clojurescript.html">http://rigsomelight.com/2014/05/01/interactive-programming-flappy-bird-clojurescript.html</a> | Interactive Programming in ClojureScript
</li>
</ul>


</div>

</div>

<div id="outline-container-9-7" class="outline-4">
<h4 id="sec-9-7">React</h4>
<div class="outline-text-4" id="text-9-7">

<ul>
<li><a href="http://facebook.github.io/react/">http://facebook.github.io/react/</a> | A JavaScript library for building user interfaces | React
</li>
<li><a href="https://github.com/swannodette/om">https://github.com/swannodette/om</a> | swannodette/om · GitHub
</li>
<li><a href="http://clojure-doc.org/articles/tutorials/emacs.html">http://clojure-doc.org/articles/tutorials/emacs.html</a> | Clojure with Emacs | Clojure Documentation | Clojure Docs
</li>
<li><a href="https://github.com/holmsand/reagent">https://github.com/holmsand/reagent</a> | holmsand/reagent · GitHub
</li>
<li><a href="https://github.com/levand/quiescent">https://github.com/levand/quiescent</a> | levand/quiescent · GitHub
</li>
</ul>


</div>

</div>

<div id="outline-container-9-8" class="outline-4">
<h4 id="sec-9-8">Starter projects:</h4>
<div class="outline-text-4" id="text-9-8">

<ul>
<li><a href="https://github.com/plexus/chestnut">https://github.com/plexus/chestnut</a> | plexus/chestnut · GitHub
</li>
<li><a href="http://blog.michielborkent.nl/blog/2014/09/25/figwheel-keep-Om-turning/">http://blog.michielborkent.nl/blog/2014/09/25/figwheel-keep-Om-turning/</a> | Figwheel Keep Om Turning! - Through the cracks of immutability
</li>
</ul>





</div>
</div>

</div>
